<a href="https://colab.research.google.com/github/rupesh743/Case-Study-2---Pizza-Runner/blob/main/Case_Study_2_Pizza_Runner.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Project** - **Danny_Pizza_Runner**

In [1]:
# Important Extensions

!pip install -q ipython-sql
%load_ext sql
%sql sqlite://

     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 7.7 MB/s eta 0:00:00

In [2]:
%%sql
CREATE TABLE runners (
  runner_id INTEGER,
  registration_date DATE
);

-- Insert data into runners table
INSERT INTO runners (runner_id, registration_date)
VALUES
  (1, '2021-01-01'),
  (2, '2021-01-03'),
  (3, '2021-01-08'),
  (4, '2021-01-15');

-- Drop customer_orders table if it exists
DROP TABLE IF EXISTS customer_orders;

-- Create customer_orders table
CREATE TABLE customer_orders (
  order_id INTEGER,
  customer_id INTEGER,
  pizza_id INTEGER,
  exclusions VARCHAR(4),
  extras VARCHAR(4),
  order_time TIMESTAMP
);

-- Insert data into customer_orders table
INSERT INTO customer_orders (order_id, customer_id, pizza_id, exclusions, extras, order_time)
VALUES
  (1, 101, 1, '', '', '2020-01-01 18:05:02'),
  (2, 101, 1, '', '', '2020-01-01 19:00:52'),
  (3, 102, 1, '', '', '2020-01-02 23:51:23'),
  (3, 102, 2, '', NULL, '2020-01-02 23:51:23'),
  (4, 103, 1, '4', '', '2020-01-04 13:23:46'),
  (4, 103, 1, '4', '', '2020-01-04 13:23:46'),
  (4, 103, 2, '4', '', '2020-01-04 13:23:46'),
  (5, 104, 1, 'null', '1', '2020-01-08 21:00:29'),
  (6, 101, 2, 'null', 'null', '2020-01-08 21:03:13'),
  (7, 105, 2, 'null', '1', '2020-01-08 21:20:29'),
  (8, 102, 1, 'null', 'null', '2020-01-09 23:54:33'),
  (9, 103, 1, '4', '1, 5', '2020-01-10 11:22:59'),
  (10, 104, 1, 'null', 'null', '2020-01-11 18:34:49'),
  (10, 104, 1, '2, 6', '1, 4', '2020-01-11 18:34:49');

-- Drop runner_orders table if it exists
DROP TABLE IF EXISTS runner_orders;

-- Create runner_orders table
CREATE TABLE runner_orders (
  order_id INTEGER,
  runner_id INTEGER,
  pickup_time VARCHAR(19),
  distance VARCHAR(7),
  duration VARCHAR(10),
  cancellation VARCHAR(23)
);

-- Insert data into runner_orders table
INSERT INTO runner_orders (order_id, runner_id, pickup_time, distance, duration, cancellation)
VALUES
  (1, 1, '2020-01-01 18:15:34', '20km', '32 minutes', ''),
  (2, 1, '2020-01-01 19:10:54', '20km', '27 minutes', ''),
  (3, 1, '2020-01-03 00:12:37', '13.4km', '20 mins', NULL),
  (4, 2, '2020-01-04 13:53:03', '23.4', '40', NULL),
  (5, 3, '2020-01-08 21:10:57', '10', '15', NULL),
  (6, 3, 'null', 'null', 'null', 'Restaurant Cancellation'),
  (7, 2, '2020-01-08 21:30:45', '25km', '25mins', 'null'),
  (8, 2, '2020-01-10 00:15:02', '23.4 km', '15 minute', 'null'),
  (9, 2, 'null', 'null', 'null', 'Customer Cancellation'),
  (10, 1, '2020-01-11 18:50:20', '10km', '10minutes', 'null');

-- Drop pizza_names table if it exists
DROP TABLE IF EXISTS pizza_names;

-- Create pizza_names table
CREATE TABLE pizza_names (
  pizza_id INTEGER,
  pizza_name TEXT
);

-- Insert data into pizza_names table
INSERT INTO pizza_names (pizza_id, pizza_name)
VALUES
  (1, 'Meatlovers'),
  (2, 'Vegetarian');

-- Drop pizza_recipes table if it exists
DROP TABLE IF EXISTS pizza_recipes;

-- Create pizza_recipes table
CREATE TABLE pizza_recipes (
  pizza_id INTEGER,
  toppings TEXT
);

-- Insert data into pizza_recipes table
INSERT INTO pizza_recipes (pizza_id, toppings)
VALUES
  (1, '1, 2, 3, 4, 5, 6, 8, 10'),
  (2, '4, 6, 7, 9, 11, 12');

-- Drop pizza_toppings table if it exists
DROP TABLE IF EXISTS pizza_toppings;

-- Create pizza_toppings table
CREATE TABLE pizza_toppings (
  topping_id INTEGER,
  topping_name TEXT
);

-- Insert data into pizza_toppings table
INSERT INTO pizza_toppings (topping_id, topping_name)
VALUES
  (1, 'Bacon'),
  (2, 'BBQ Sauce'),
  (3, 'Beef'),
  (4, 'Cheese'),
  (5, 'Chicken'),
  (6, 'Mushrooms'),
  (7, 'Onions'),
  (8, 'Pepperoni'),
  (9, 'Peppers'),
  (10, 'Salami'),
  (11, 'Tomatoes'),
  (12, 'Tomato Sauce');

 * sqlite://
Done.
4 rows affected.
Done.
Done.
14 rows affected.
Done.
Done.
10 rows affected.
Done.
Done.
2 rows affected.
Done.
Done.
2 rows affected.
Done.
Done.
12 rows affected.

[]

# **Let's Begin**

This code creates a temporary table named customer_order based on the logic you provided, where the exclusions and extras columns are cleaned and stored as exclusions_cleaned and extras_cleaned, respectively. Let me know if you need further assistance!

In [3]:
%%sql

CREATE TEMPORARY TABLE customer_order AS
SELECT
  order_id,
  customer_id,
  pizza_id,
  order_time,
  CASE
    WHEN exclusions = '' THEN NULL
    WHEN exclusions = 'null' THEN NULL
    ELSE exclusions
  END AS exclusions_cleaned,
  CASE
    WHEN extras = '' THEN NULL
    WHEN extras = 'null' THEN NULL
    ELSE extras
  END AS extras_cleaned
FROM customer_orders;

 * sqlite://
Done.

[]

This SQL code creates a temporary table called runner_order based on a query result.

The SELECT statement retrieves data from the runner_orders table and applies transformations to certain columns:

The CASE statements are used to conditionally replace certain values in the columns:

n_pickup_time column replaces 'null' values with actual NULL values.

n_distance column replaces 'null' values with actual NULL values and removes 'km' from distance values.

n_duration column replaces 'null' values with actual NULL values, removes 'mins', 'minute', or 'minutes' from duration values.

n_cancellation column replaces 'null' values or empty strings with actual NULL values.

The transformed data is then stored in the temporary table runner_order.

In [4]:
%%sql
CREATE TEMPORARY TABLE runner_order AS
SELECT
  order_id,
  runner_id,
  CASE
    WHEN pickup_time = 'null' THEN NULL
    ELSE pickup_time
  END AS n_pickup_time,
  CASE
    WHEN distance = 'null' THEN NULL
    WHEN distance LIKE '%km' THEN REPLACE(distance, 'km', '')
    ELSE distance
  END AS n_distance,
  CASE
    WHEN duration = 'null' THEN NULL
    WHEN duration LIKE '%mins' THEN REPLACE(duration, 'mins', '')
    WHEN duration LIKE '%minute' THEN REPLACE(duration, 'minute', '')
    WHEN duration LIKE '%minutes' THEN REPLACE(duration, 'minutes', '')
    ELSE duration
  END AS n_duration,
  CASE
    WHEN cancellation IS NULL OR cancellation LIKE 'null' THEN NULL
    WHEN cancellation = '' THEN NULL
    ELSE cancellation
  END AS n_cancellation
FROM runner_orders;

 * sqlite://
Done.

[]

In [5]:
%%sql
select * from runners

 * sqlite://
Done.

[(1, '2021-01-01'), (2, '2021-01-03'), (3, '2021-01-08'), (4, '2021-01-15')]

In [6]:
%%sql
select * from customer_order

 * sqlite://
Done.

[(1, 101, 1, '2020-01-01 18:05:02', None, None),
 (2, 101, 1, '2020-01-01 19:00:52', None, None),
 (3, 102, 1, '2020-01-02 23:51:23', None, None),
 (3, 102, 2, '2020-01-02 23:51:23', None, None),
 (4, 103, 1, '2020-01-04 13:23:46', '4', None),
 (4, 103, 1, '2020-01-04 13:23:46', '4', None),
 (4, 103, 2, '2020-01-04 13:23:46', '4', None),
 (5, 104, 1, '2020-01-08 21:00:29', None, '1'),
 (6, 101, 2, '2020-01-08 21:03:13', None, None),
 (7, 105, 2, '2020-01-08 21:20:29', None, '1'),
 (8, 102, 1, '2020-01-09 23:54:33', None, None),
 (9, 103, 1, '2020-01-10 11:22:59', '4', '1, 5'),
 (10, 104, 1, '2020-01-11 18:34:49', None, None),
 (10, 104, 1, '2020-01-11 18:34:49', '2, 6', '1, 4')]

In [7]:
%%sql
select * from runner_order

 * sqlite://
Done.

[(1, 1, '2020-01-01 18:15:34', '20', '32 ', None),
 (2, 1, '2020-01-01 19:10:54', '20', '27 ', None),
 (3, 1, '2020-01-03 00:12:37', '13.4', '20 ', None),
 (4, 2, '2020-01-04 13:53:03', '23.4', '40', None),
 (5, 3, '2020-01-08 21:10:57', '10', '15', None),
 (6, 3, None, None, None, 'Restaurant Cancellation'),
 (7, 2, '2020-01-08 21:30:45', '25', '25', None),
 (8, 2, '2020-01-10 00:15:02', '23.4 ', '15 ', None),
 (9, 2, None, None, None, 'Customer Cancellation'),
 (10, 1, '2020-01-11 18:50:20', '10', '10', None)]

In [8]:
%%sql
select * from pizza_names

 * sqlite://
Done.

[(1, 'Meatlovers'), (2, 'Vegetarian')]

In [9]:
%%sql
select * from pizza_recipes

 * sqlite://
Done.

[(1, '1, 2, 3, 4, 5, 6, 8, 10'), (2, '4, 6, 7, 9, 11, 12')]

In [10]:
%%sql
select * from pizza_toppings

 * sqlite://
Done.

[(1, 'Bacon'),
 (2, 'BBQ Sauce'),
 (3, 'Beef'),
 (4, 'Cheese'),
 (5, 'Chicken'),
 (6, 'Mushrooms'),
 (7, 'Onions'),
 (8, 'Pepperoni'),
 (9, 'Peppers'),
 (10, 'Salami'),
 (11, 'Tomatoes'),
 (12, 'Tomato Sauce')]

# Case Study Questions

This case study has LOTS of questions - they are broken up by area of focus including:

- **Pizza Metrics**
- **Runner and Customer Experience**
- **Ingredient Optimisation**
- **Pricing and Ratings**
- **Bonus DML Challenges** (DML = Data Manipulation Language)

Each of the following case study questions can be answered using a single SQL statement.

Before you start writing your SQL queries however - you might want to investigate the data. You may want to do something with some of those null values and data types in the `customer_orders` and `runner_orders` tables!

## A. Pizza Metrics

1. How many pizzas were ordered?
2. How many unique customer orders were made?
3. How many successful orders were delivered by each runner?
4. How many of each type of pizza was delivered?
5. How many Vegetarian and Meatlovers were ordered by each customer?
6. What was the maximum number of pizzas delivered in a single order?
7. For each customer, how many delivered pizzas had at least 1 change and how many had no changes?
8. How many pizzas were delivered that had both exclusions and extras?
9. What was the total volume of pizzas ordered for each hour of the day?
10. What was the volume of orders for each day of the week?

## B. Runner and Customer Experience

1. How many runners signed up for each 1 week period? (i.e. week starts 2021-01-01)
2. What was the average time in minutes it took for each runner to arrive at the Pizza Runner HQ to pickup the order?
3. Is there any relationship between the number of pizzas and how long the order takes to prepare?
4. What was the average distance travelled for each customer?
5. What was the difference between the longest and shortest delivery times for all orders?
6. What was the average speed for each runner for each delivery and do you notice any trend for these values?
7. What is the successful delivery percentage for each runner?

## C. Ingredient Optimisation

1. What are the standard ingredients for each pizza?
2. What was the most commonly added extra?
3. What was the most common exclusion?
4. Generate an order item for each record in the `customers_orders` table in the format of one of the following:
    - Meat Lovers
    - Meat Lovers - Exclude Beef
    - Meat Lovers - Extra Bacon
    - Meat Lovers - Exclude Cheese, Bacon - Extra Mushroom, Peppers
5. Generate an alphabetically ordered comma separated ingredient list for each pizza order from the `customer_orders` table and add a `2x` in front of any relevant ingredients.
    - For example: "Meat Lovers: 2xBacon, Beef, ... , Salami"
6. What is the total quantity of each ingredient used in all delivered pizzas sorted by most frequent first?

## D. Pricing and Ratings

1. If a Meat Lovers pizza costs 12 and Vegetarian costs 10 and there were no charges for changes - how much money has Pizza Runner made so far if there are no delivery fees?
2. What if there was an additional 1 charge for any pizza extras?
    - Add cheese is $1 extra
3. The Pizza Runner team now wants to add an additional ratings system that allows customers to rate their runner, how would you design an additional table for this new dataset - generate a schema for this new table and insert your own data for ratings for each successful customer order between 1 to 5.
4. Using your newly generated table - can you join all of the information together to form a table which has the following information for successful deliveries?
    - customer_id
    - order_id
    - runner_id
    - rating
    - order_time
    - pickup_time
    - Time between order and pickup
    - Delivery duration
    - Average speed
    - Total number of pizzas
5. If a Meat Lovers pizza was 12 and Vegetarian 10 fixed prices with no cost for extras and each runner is paid $0.30 per kilometre traveled - how much money does Pizza Runner have left over after these deliveries?

# **A. Pizza Metrics**

In [11]:
%%sql
-- 1. How many pizzas were ordered?
select count(*) as pizza_order_count
from customer_orders;

 * sqlite://
Done.

[(14,)]

In [12]:
%%sql
-- 2. How many unique customer orders were made?
select count(distinct order_id) as unique_order_count
from customer_orders;

 * sqlite://
Done.

[(10,)]

In [13]:
%%sql
-- 3. How many successful orders were delivered by each runner?
select runner_id, count(order_id) as successful_orders
from runner_orders
where duration is not null
group by runner_id;

 * sqlite://
Done.

[(1, 4), (2, 4), (3, 2)]

In [14]:
%%sql
-- 4. How many of each type of pizza was delivered?
select p.pizza_name, count(c.pizza_id) as pizza_count
from customer_orders c
join pizza_names p on c.pizza_id = p.pizza_id
where c.order_id in (
  select order_id
  from runner_order
  where n_cancellation is null
)
group by p.pizza_name;

 * sqlite://
Done.

[('Meatlovers', 9), ('Vegetarian', 3)]

In [15]:
%%sql
-- 5. How many Vegetarian and Meatlovers were ordered by each customer?
select customer_id, pizza_name, count(pizza_name) as order_count
from customer_orders c
join pizza_names p on c.pizza_id = p.pizza_id
group by customer_id, pizza_name
order by customer_id;

 * sqlite://
Done.

[(101, 'Meatlovers', 2),
 (101, 'Vegetarian', 1),
 (102, 'Meatlovers', 2),
 (102, 'Vegetarian', 1),
 (103, 'Meatlovers', 3),
 (103, 'Vegetarian', 1),
 (104, 'Meatlovers', 3),
 (105, 'Vegetarian', 1)]

In [16]:
%%sql
-- 6. What was the maximum number of pizzas delivered in a single order?
select order_id, count(pizza_id) as pizza_count
from customer_order
group by order_id
order by pizza_count desc;

 * sqlite://
Done.

[(4, 3),
 (10, 2),
 (3, 2),
 (9, 1),
 (8, 1),
 (7, 1),
 (6, 1),
 (5, 1),
 (2, 1),
 (1, 1)]

In [17]:
%%sql
-- 7. For each customer, how many delivered pizzas had at least 1 change and how many had no changes?

WITH STATUS_TBL AS (
    SELECT
        order_id,
        customer_id,
        pizza_id,
        exclusions_cleaned,
        extras_cleaned,
        CASE
            WHEN exclusions_cleaned <> '' OR extras_cleaned <> '' THEN 'Change'
            ELSE 'No_Change'
        END AS Status
    FROM
        customer_order
)
SELECT
    customer_id,
    COALESCE(s.Status, 'No_Change') AS STATUS,
    COUNT(s.Status) AS count
FROM
    runner_order AS r
LEFT JOIN
    STATUS_TBL AS s ON s.order_id = r.order_id
WHERE
    r.n_distance != 0
GROUP BY
    customer_id,
    STATUS
ORDER BY
    customer_id;

 * sqlite://
Done.

[(101, 'No_Change', 2),
 (102, 'No_Change', 3),
 (103, 'Change', 3),
 (104, 'Change', 2),
 (104, 'No_Change', 1),
 (105, 'Change', 1)]

In [18]:
%%sql
-- 8. How many pizzas were delivered that had both exclusions and extras?
select count(*) as pizza_count
from customer_order
where exclusions_cleaned is not null and extras_cleaned is not null;

 * sqlite://
Done.

[(2,)]

In [19]:
%%sql
-- 9. What was the total volume of pizzas ordered for each hour of the day?

SELECT
  strftime('%H', order_time) AS hour_of_pickup,
  COUNT(order_id) AS count_pizza
FROM
  customer_order
WHERE
  strftime('%H', order_time) IS NOT NULL
GROUP BY
  strftime('%H', order_time);

 * sqlite://
Done.

[('11', 1), ('13', 3), ('18', 3), ('19', 1), ('21', 3), ('23', 3)]

In [20]:
%%sql
-- 10. What was the volume of orders for each day of the week?
select strftime('%w', order_time) as day_of_week, count(order_id) as order_count
from customer_order
group by day_of_week;

 * sqlite://
Done.

[('3', 5), ('4', 3), ('5', 1), ('6', 5)]

# **B. Runner and Customer Experience**

In [21]:
%%sql
-- 1. How many runners signed up for each 1 week period? (i.e. week starts 2021-01-01)
SELECT
  strftime('%Y-%W', registration_date) AS week_start,
  COUNT(runner_id) AS runners_signed_up
FROM
  runners
GROUP BY
  strftime('%Y-%W', registration_date)
ORDER BY
  week_start;

 * sqlite://
Done.

[('2021-00', 2), ('2021-01', 1), ('2021-02', 1)]

In [22]:
%%sql
-- 2. What was the average time in minutes it took for each runner to arrive at the Pizza Runner HQ to pickup the order?
SELECT
  r.runner_id,
  ROUND(AVG((strftime('%s', r.n_pickup_time) - strftime('%s', c.order_time)) / 60.0), 2) AS avg_pickup_time_minutes
FROM
  runner_order r
JOIN
  customer_orders c
ON
  r.order_id = c.order_id
WHERE
  r.n_pickup_time IS NOT NULL
GROUP BY
  r.runner_id
ORDER BY
  r.runner_id;

 * sqlite://
Done.

[(1, 15.68), (2, 23.72), (3, 10.47)]

In [23]:
%%sql
-- 3. Is there any relationship between the number of pizzas and how long the order takes to prepare?
SELECT
  c.pizza_id,
  ROUND(AVG((strftime('%s', r.n_pickup_time) - strftime('%s', c.order_time)) / 60.0), 2) AS avg_time_to_prepare
FROM
  runner_order r
JOIN
  customer_orders c
ON
  r.order_id = c.order_id
WHERE
  r.n_pickup_time IS NOT NULL
GROUP BY
  c.pizza_id
ORDER BY
  c.pizza_id;

 * sqlite://
Done.

[(1, 18.04), (2, 20.26)]

In [24]:
%%sql
-- 4. What was the average distance travelled for each customer?
SELECT c.customer_id, ROUND(AVG(r.n_distance)) AS avg_dist FROM customer_order c
JOIN runner_order r on c.order_id = r.order_id
GROUP BY c.customer_id;

 * sqlite://
Done.

[(101, 20.0), (102, 17.0), (103, 23.0), (104, 10.0), (105, 25.0)]

In [25]:
%%sql
-- 5. What was the difference between the longest and shortest delivery times for all orders?
select max(n_duration) - min(n_duration) as req_time
from runner_order;

 * sqlite://
Done.

[(30,)]

In [26]:
%%sql
-- 6. What was the average speed for each runner for each delivery and do you notice any trend for these values?
SELECT
  runner_id,
  order_id,
  round(AVG(n_distance) / AVG(n_duration / 60.0), 2) AS avg_speed
FROM
  runner_order
WHERE
  n_distance IS NOT NULL
GROUP BY
  runner_id,
  order_id;

 * sqlite://
Done.

[(1, 1, 37.5),
 (1, 2, 44.44),
 (1, 3, 40.2),
 (1, 10, 60.0),
 (2, 4, 35.1),
 (2, 7, 60.0),
 (2, 8, 93.6),
 (3, 5, 40.0)]

In [27]:
%%sql
-- 7. What is the successful delivery percentage for each runner?
WITH succ_ord AS (
  SELECT
    runner_id,
    COUNT(order_id) AS delivered
  FROM
    runner_order
  WHERE
    n_distance IS NOT NULL
  GROUP BY
    runner_id
)
SELECT
  r.runner_id,
  (CAST(succ_ord.delivered AS FLOAT) / COUNT(*) * 100) AS perc_deli
FROM
  succ_ord
JOIN
  runner_order r ON succ_ord.runner_id = r.runner_id
GROUP BY
  r.runner_id;

 * sqlite://
Done.

[(1, 100.0), (2, 75.0), (3, 50.0)]

# **C. Ingredient Optimisation**

In [28]:
%%sql
-- 1. What are the standard ingredients for each pizza?

SELECT
  pr.pizza_id,
  pt.topping_name
FROM
  pizza_recipes pr
LEFT JOIN
  pizza_toppings pt ON pr.toppings LIKE '%' || pt.topping_id || '%';

 * sqlite://
Done.

[(1, 'Bacon'),
 (1, 'BBQ Sauce'),
 (1, 'Beef'),
 (1, 'Cheese'),
 (1, 'Chicken'),
 (1, 'Mushrooms'),
 (1, 'Pepperoni'),
 (1, 'Salami'),
 (2, 'Bacon'),
 (2, 'BBQ Sauce'),
 (2, 'Cheese'),
 (2, 'Mushrooms'),
 (2, 'Onions'),
 (2, 'Peppers'),
 (2, 'Tomatoes'),
 (2, 'Tomato Sauce')]

In [29]:
%%sql
-- 2. What was the most commonly added extra?
select extras_cleaned, count(extras_cleaned) as total_count
from customer_order
where extras_cleaned like '%'
group by extras_cleaned;

 * sqlite://
Done.

[('1', 2), ('1, 4', 1), ('1, 5', 1)]

In [30]:
%%sql
-- 3. What was the most common exclusion?
select exclusions_cleaned, count(exclusions_cleaned) as total_count
from customer_order
where exclusions_cleaned like '%'
group by exclusions_cleaned;

 * sqlite://
Done.

[('2, 6', 1), ('4', 4)]

In [31]:
%%sql
-- 4.   Generate an order item for each record in the customers_orders table in the format of one of the following:
-- 4.1. Meat Lovers
select order_id
from customer_order
where pizza_id = 1
group by order_id;

 * sqlite://
Done.

[(1,), (2,), (3,), (4,), (5,), (8,), (9,), (10,)]

In [32]:
%%sql
-- 4.2. Meat Lovers - Exclude Beef
select order_id
from customer_order
where pizza_id = 1 and exclusions_cleaned = 3
group by order_id;

 * sqlite://
Done.

[]

In [33]:
%%sql
-- 4.3. Meat Lovers - Extra Bacon
select order_id
from customer_order
where pizza_id = 1 and extras_cleaned in (1, 4)
group by order_id;

 * sqlite://
Done.

[]

In [45]:
%%sql
-- 4.4. Meat Lovers - Exclude Cheese, Bacon - Extra Mushroom, Peppers
SELECT
    order_id,
    CASE
        WHEN pizza_id = 1
            AND exclusions_cleaned LIKE '%1%' OR exclusions_cleaned LIKE '%4%'
            AND extras_cleaned LIKE '%6%' OR extras_cleaned LIKE '%9%' THEN 1
        ELSE 0
    END AS order_count
FROM
    customer_order
GROUP BY
    order_id;

 * sqlite://
Done.

[(1, 0),
 (2, 0),
 (3, 0),
 (4, 0),
 (5, 0),
 (6, 0),
 (7, 0),
 (8, 0),
 (9, 0),
 (10, 0)]

# **D. Pricing and Ratings**

In [35]:
%%sql
-- 1. If a Meat Lovers pizza costs $12 and Vegetarian costs $10 and there were no charges for changes -
-- how much money has Pizza Runner made so far if there are no delivery fees?
select sum(case when pizza_id = 1 then 12 else 10 end) as total_revenue
from customer_order c
join runner_order r on c.order_id = r.order_id
where r.n_cancellation is null;

 * sqlite://
Done.

[(138,)]

In [36]:
%%sql
-- 2. What if there was an additional $1 charge for any pizza extras? Add cheese is $1 extra
select sum(case when pizza_id = 1 then 12 else 10 end + case when extras_cleaned like '%4%' then 1 else 0 end + case when extras_cleaned is not null  then 1 else 0 end) as total_revenue
from customer_order c
join runner_order r on c.order_id = r.order_id
where r.n_cancellation is null;

 * sqlite://
Done.

[(142,)]

In [37]:
%%sql
-- 3. The Pizza Runner team now wants to add an additional ratings system that allows customers to rate their runner,
-- how would you design an additional table for this new dataset - generate a schema for this new table and insert your
-- own data for ratings for each successful customer order between 1 to 5.
CREATE TABLE ratings (n_order_id INT , rating INT);
INSERT INTO ratings (n_order_id, rating) VALUES (1,3), (2,4), (3,5), (4,2),(5,1), (6,3), (7,4), (8,1), (9,3), (10,5);

 * sqlite://
Done.
10 rows affected.

[]

In [38]:
%%sql
-- 4. Using your newly generated table - can you join all of the information together to form a table
-- which has the following information for successful deliveries?
-- customer_id
-- order_id
-- runner_id
-- rating
-- order_time
-- pickup_time
-- Time between order and pickup
-- Delivery duration
-- Average speed
-- Total number of pizzas

SELECT
    c.customer_id,
    c.order_id,
    c.order_time,
    r.runner_id,
    r.n_duration,
    r.n_pickup_time,
    rs.rating,
    (strftime('%s', r.n_pickup_time) - strftime('%s', c.order_time)) / 60 AS order_pickup_time,
    ROUND(AVG(r.n_distance / (r.n_duration / 60.0)), 2) AS avg_speed,
    COUNT(c.pizza_id) AS total_pizza
FROM
    customer_order c
JOIN
    runner_order r ON r.order_id = c.order_id
JOIN
    ratings rs ON c.order_id = rs.n_order_id
WHERE
    r.n_cancellation IS NULL
GROUP BY
    c.customer_id,
    c.order_id,
    c.order_time,
    r.runner_id;

 * sqlite://
Done.

[(101, 1, '2020-01-01 18:05:02', 1, '32 ', '2020-01-01 18:15:34', 3, 10, 37.5, 1),
 (101, 2, '2020-01-01 19:00:52', 1, '27 ', '2020-01-01 19:10:54', 4, 10, 44.44, 1),
 (102, 3, '2020-01-02 23:51:23', 1, '20 ', '2020-01-03 00:12:37', 5, 21, 40.2, 2),
 (102, 8, '2020-01-09 23:54:33', 2, '15 ', '2020-01-10 00:15:02', 1, 20, 93.6, 1),
 (103, 4, '2020-01-04 13:23:46', 2, '40', '2020-01-04 13:53:03', 2, 29, 35.1, 3),
 (104, 5, '2020-01-08 21:00:29', 3, '15', '2020-01-08 21:10:57', 1, 10, 40.0, 1),
 (104, 10, '2020-01-11 18:34:49', 1, '10', '2020-01-11 18:50:20', 5, 15, 60.0, 2),
 (105, 7, '2020-01-08 21:20:29', 2, '25', '2020-01-08 21:30:45', 4, 10, 60.0, 1)]

In [39]:
%%sql
-- 5. If a Meat Lovers pizza was $12 and Vegetarian $10 fixed prices with no cost for extras and each runner
-- is paid $0.30 per kilometre traveled - how much money does Pizza Runner have left over after these deliveries?
SELECT runner_id, SUM(pizza_cost) AS total_revenue,
       SUM(n_distance) * 0.3 AS total_spend,
       SUM(pizza_cost) - SUM(n_distance) * 0.3 AS profit
FROM (SELECT r.runner_id, r.n_distance,
       CASE
			WHEN c.pizza_id = 1 THEN 12
			WHEN c.pizza_id = 2 THEN 10 END AS pizza_cost
       FROM customer_orders c
       JOIN runner_order r ON c.order_id = r.order_id
       WHERE r.n_cancellation IS NULL) AS pizza_cost_per_run
GROUP BY runner_id;

 * sqlite://
Done.

[(1, 70, 26.04, 43.96), (2, 56, 35.58, 20.42), (3, 12, 3.0, 9.0)]